In [2]:
import numpy as np
import pandas as pd

In [8]:
data = np.random.randn(4,3)
data

array([[ 1.40054057,  2.03519685, -0.86306839],
       [-0.44709763, -0.03578277,  0.93004878],
       [-0.05355483, -0.28183988, -0.39368486],
       [ 2.06527043, -0.18479999,  1.26976808]])

In [10]:
dataFrame = pd.DataFrame(data)

In [12]:
dataFrame

          0         1         2
0  1.400541  2.035197 -0.863068
1 -0.447098 -0.035783  0.930049
2 -0.053555 -0.281840 -0.393685
3  2.065270 -0.184800  1.269768

In [26]:
newDataFrame = pd.DataFrame(data, index = ["Name","Surname","Age","Grade"], columns=["Person1","Person2","Person3"] )
newDataFrame

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

## Column Operations

In [28]:
newDataFrame["Person1"]

Name       1.400541
Surname   -0.447098
Age       -0.053555
Grade      2.065270
Name: Person1, dtype: float64

In [30]:
newDataFrame["Person2"]

Name       2.035197
Surname   -0.035783
Age       -0.281840
Grade     -0.184800
Name: Person2, dtype: float64

In [34]:
newDataFrame[["Person1","Person2"]]

          Person1   Person2
Name     1.400541  2.035197
Surname -0.447098 -0.035783
Age     -0.053555 -0.281840
Grade    2.065270 -0.184800

## Row Operations

In [42]:
newDataFrame.loc["Name"]

Person1    1.400541
Person2    2.035197
Person3   -0.863068
Name: Name, dtype: float64

In [44]:
newDataFrame.loc["Surname"]

Person1   -0.447098
Person2   -0.035783
Person3    0.930049
Name: Surname, dtype: float64

In [46]:
newDataFrame.iloc[0]

Person1    1.400541
Person2    2.035197
Person3   -0.863068
Name: Name, dtype: float64

In [48]:
newDataFrame.iloc[1]

Person1   -0.447098
Person2   -0.035783
Person3    0.930049
Name: Surname, dtype: float64

In [50]:
newDataFrame

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

In [52]:
## Add a column
newDataFrame["Person4"] = newDataFrame["Person1"] + newDataFrame["Person2"]

In [57]:
newDataFrame

          Person1   Person2   Person3   Person4
Name     1.400541  2.035197 -0.863068  3.435737
Surname -0.447098 -0.035783  0.930049 -0.482880
Age     -0.053555 -0.281840 -0.393685 -0.335395
Grade    2.065270 -0.184800  1.269768  1.880470

In [67]:
## Remove a column

newDataFrame.drop("Person4", axis=1)

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

In [73]:
## Remove a row

newDataFrame.drop("Name", axis=0)

          Person1   Person2   Person3   Person4
Surname -0.447098 -0.035783  0.930049 -0.482880
Age     -0.053555 -0.281840 -0.393685 -0.335395
Grade    2.065270 -0.184800  1.269768  1.880470

In [75]:
newDataFrame

          Person1   Person2   Person3   Person4
Name     1.400541  2.035197 -0.863068  3.435737
Surname -0.447098 -0.035783  0.930049 -0.482880
Age     -0.053555 -0.281840 -0.393685 -0.335395
Grade    2.065270 -0.184800  1.269768  1.880470

In [77]:
newDataFrame.drop("Person4", axis=1 , inplace = True)

In [79]:
newDataFrame

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

In [83]:
newDataFrame.loc["Name"]

Person1    1.400541
Person2    2.035197
Person3   -0.863068
Name: Name, dtype: float64

In [85]:
newDataFrame.loc["Name"]["Person1"]

1.4005405704531386

In [89]:
newDataFrame

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

In [91]:
newDataFrame <0

         Person1  Person2  Person3
Name       False    False     True
Surname     True     True    False
Age         True     True     True
Grade      False     True    False

In [93]:
newDataFrame

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

In [95]:
newDataFrame.reset_index()

     index   Person1   Person2   Person3
0     Name  1.400541  2.035197 -0.863068
1  Surname -0.447098 -0.035783  0.930049
2      Age -0.053555 -0.281840 -0.393685
3    Grade  2.065270 -0.184800  1.269768

In [97]:
newDataFrame

          Person1   Person2   Person3
Name     1.400541  2.035197 -0.863068
Surname -0.447098 -0.035783  0.930049
Age     -0.053555 -0.281840 -0.393685
Grade    2.065270 -0.184800  1.269768

In [111]:
newIndexList = ["A", "B", "C" ,"D"]

In [121]:
newDataFrame["New Index"]= newIndexList

In [123]:
newDataFrame

          Person1   Person2   Person3 New Index
Name     1.400541  2.035197 -0.863068         A
Surname -0.447098 -0.035783  0.930049         B
Age     -0.053555 -0.281840 -0.393685         C
Grade    2.065270 -0.184800  1.269768         D

In [125]:
newDataFrame.set_index("New Index")

            Person1   Person2   Person3
New Index
A          1.400541  2.035197 -0.863068
B         -0.447098 -0.035783  0.930049
C         -0.053555 -0.281840 -0.393685
D          2.065270 -0.184800  1.269768

In [127]:
newDataFrame

          Person1   Person2   Person3 New Index
Name     1.400541  2.035197 -0.863068         A
Surname -0.447098 -0.035783  0.930049         B
Age     -0.053555 -0.281840 -0.393685         C
Grade    2.065270 -0.184800  1.269768         D

In [129]:
newDataFrame.set_index("New Index", inplace=True)

In [131]:
newDataFrame

            Person1   Person2   Person3
New Index
A          1.400541  2.035197 -0.863068
B         -0.447098 -0.035783  0.930049
C         -0.053555 -0.281840 -0.393685
D          2.065270 -0.184800  1.269768

In [133]:
newDataFrame.loc["A"]

Person1    1.400541
Person2    2.035197
Person3   -0.863068
Name: A, dtype: float64

In [137]:
newDataFrame.iloc[0]

Person1    1.400541
Person2    2.035197
Person3   -0.863068
Name: A, dtype: float64

In [139]:
firstIndex = ["DC", "DC","Marvel","Marvel","Marvel"]

In [141]:
internalIndex = ["Batman", "Superman", "Thor", "Captain America", "Black Widow"]

In [143]:
associatedIndex = list (zip(firstIndex,internalIndex))
associatedIndex

[('DC', 'Batman'),
 ('DC', 'Superman'),
 ('Marvel', 'Thor'),
 ('Marvel', 'Captain America'),
 ('Marvel', 'Black Widow')]

In [145]:
associatedIndex = pd.MultiIndex.from_tuples(associatedIndex)
associatedIndex

MultiIndex([(    'DC',          'Batman'),
            (    'DC',        'Superman'),
            ('Marvel',            'Thor'),
            ('Marvel', 'Captain America'),
            ('Marvel',     'Black Widow')],
           )

In [ ]:
mySuperHeros = [[]]